Console.Write("Введите имя пользователя");
string username = Console.ReadLine();

if(username.ToLower() == " иконостас")
{
    Console.WriteLine("___________________ссссс");
Console.WriteLine("_________________сс_____ссс");
Console.WriteLine("______________ссссссссссссссссс");
Console.WriteLine("___________ссс_________________ссс");
Console.WriteLine("_________сс_______________________сс");
Console.WriteLine("_______сс____________ссс____________сс");
Console.WriteLine("______сс_____ссссссссс__сссссссссссс_сс");
Console.WriteLine("_____сс__ссссссссс____сс____сс___ссссссс");
Console.WriteLine("_____сссссс___сс______сс_____сс_______сс");
Console.WriteLine("_____сс_______сс___с_ссс_с___сс_______сс");
Console.WriteLine("_____сс_______сс____сс_сс____сс_______сс");
Console.WriteLine("_____сс________ссссссс__сссссс_______сс");
Console.WriteLine("______сс____________________________сс");
Console.WriteLine("____ссссссс________сс_____сс_____сссссссс");
Console.WriteLine("___сс____сссс________сссс____ссссс_____сс");
Console.WriteLine("__ссссс______сссссс__________сссссс____ссссс");
Console.WriteLine("сс____сс________ссссссссссссс________сс___сс");
Console.WriteLine("сс_____сс______________сс___________сс____сс");
Console.WriteLine("сс_____сс_____________ссс____________ссс__сс");
Console.WriteLine("_ссс__сс_______________сс_______________ссс");
Console.WriteLine("___ссс________________ссс________________сс");
Console.WriteLine("____сс_________________сс_______________сс");
Console.WriteLine("_____сссссссссссссссс__сс___сссссссссссс");
Console.WriteLine("______сс____________сс_сс_сс_________сс");
Console.WriteLine("_____ссссссссссссссссссссссссссссссссссссссс");
}
else
{
    Console.Write("привет");
    Console.WriteLine(username);
}